In [2]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
....: [NA, NA, NA], [NA, 6.5, 3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
 data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = NA
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.002554       NaN       NaN
1  1.621362       NaN       NaN
2 -1.697455       NaN  0.155502
3  0.052773       NaN  0.714796
4 -1.061246  0.543879 -0.043170
5  0.722573 -1.184747  0.202062
6 -0.973594 -0.661812  0.158687

In [18]:
df.dropna()

          0         1         2
4 -1.061246  0.543879 -0.043170
5  0.722573 -1.184747  0.202062
6 -0.973594 -0.661812  0.158687

In [19]:
df.dropna(thresh=2)

          0         1         2
2 -1.697455       NaN  0.155502
3  0.052773       NaN  0.714796
4 -1.061246  0.543879 -0.043170
5  0.722573 -1.184747  0.202062
6 -0.973594 -0.661812  0.158687

In [20]:
df.fillna(0)

          0         1         2
0 -0.002554  0.000000  0.000000
1  1.621362  0.000000  0.000000
2 -1.697455  0.000000  0.155502
3  0.052773  0.000000  0.714796
4 -1.061246  0.543879 -0.043170
5  0.722573 -1.184747  0.202062
6 -0.973594 -0.661812  0.158687

In [21]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.002554  0.500000  0.000000
1  1.621362  0.500000  0.000000
2 -1.697455  0.500000  0.155502
3  0.052773  0.500000  0.714796
4 -1.061246  0.543879 -0.043170
5  0.722573 -1.184747  0.202062
6 -0.973594 -0.661812  0.158687

In [22]:
df

          0         1         2
0 -0.002554       NaN       NaN
1  1.621362       NaN       NaN
2 -1.697455       NaN  0.155502
3  0.052773       NaN  0.714796
4 -1.061246  0.543879 -0.043170
5  0.722573 -1.184747  0.202062
6 -0.973594 -0.661812  0.158687

In [23]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.002554  0.000000  0.000000
1  1.621362  0.000000  0.000000
2 -1.697455  0.000000  0.155502
3  0.052773  0.000000  0.714796
4 -1.061246  0.543879 -0.043170
5  0.722573 -1.184747  0.202062
6 -0.973594 -0.661812  0.158687

In [24]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  1.124052  0.602177  0.483592
1  0.449577 -0.065381 -0.435853
2 -1.347598       NaN -0.180081
3  0.115873       NaN -0.118448
4  0.737942       NaN       NaN
5 -0.019998       NaN       NaN

In [25]:
df.fillna(method='ffill')

          0         1         2
0  1.124052  0.602177  0.483592
1  0.449577 -0.065381 -0.435853
2 -1.347598 -0.065381 -0.180081
3  0.115873 -0.065381 -0.118448
4  0.737942 -0.065381 -0.118448
5 -0.019998 -0.065381 -0.118448

In [26]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.124052  0.602177  0.483592
1  0.449577 -0.065381 -0.435853
2 -1.347598 -0.065381 -0.180081
3  0.115873 -0.065381 -0.118448
4  0.737942       NaN -0.118448
5 -0.019998       NaN -0.118448

In [27]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [28]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
....: 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
 data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [34]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
....: 'Pastrami', 'corned beef', 'Bacon',
....: 'pastrami', 'honey ham', 'nova lox'],
....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [35]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [36]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [37]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [38]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [39]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [41]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [42]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [3]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=['Ohio','Colorado','New York'],
                   columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [4]:
transform = lambda x: x[:].upper()
transform

In [5]:
data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [6]:
data.index = data.index.map(transform)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [7]:
data.rename(index=str.upper,columns=str.title)

          One  Two  Three  Four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [8]:
data.rename(index={'OHIO':'INDINA'},
           columns={'three':'five'})

          one  two  five  four
INDINA      0    1     2     3
COLORADO    4    5     6     7
NEW YORK    8    9    10    11

In [9]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)
data

          one  two  three  four
INDIANA     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [10]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [11]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [12]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [13]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [14]:
group_names = ['Youth','YouthAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YouthAdult, Youth, ..., YouthAdult, Senior, MiddleAged, MiddleAged, YouthAdult]
Length: 12
Categories (4, object): [Youth < YouthAdult < MiddleAged < Senior]

In [15]:
data = np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.66, 0.88], (0.0042, 0.22], (0.0042, 0.22], (0.44, 0.66], (0.44, 0.66], ..., (0.0042, 0.22], (0.44, 0.66], (0.22, 0.44], (0.22, 0.44], (0.22, 0.44]]
Length: 20
Categories (4, interval[float64]): [(0.0042, 0.22] < (0.22, 0.44] < (0.44, 0.66] < (0.66, 0.88]]

In [16]:


data = np.random.randn(1000)
cats = pd.cut(data,4)

In [17]:
pd.value_counts(cats)

(-1.489, 0.249]     532
(0.249, 1.987]      386
(-3.234, -1.489]     63
(1.987, 3.726]       19
dtype: int64

In [18]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.014218     0.002751     0.009664     0.045111
std       1.025279     1.046620     1.017151     0.977082
min      -3.186767    -3.153685    -2.954072    -2.940354
25%      -0.649104    -0.690982    -0.663385    -0.595805
50%       0.031253    -0.007540     0.007965     0.023703
75%       0.677887     0.705108     0.730514     0.700775
max       3.562565     3.560758     4.476422     4.158149

In [19]:
col = data[2]
col[np.abs(col)>3]

105    4.476422
689    3.765516
913    3.004477
Name: 2, dtype: float64

In [20]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
39  -0.398035  3.560758  0.720450  0.745703
104  3.562565  1.744528  1.551855  0.165442
105 -2.360747 -0.514586  4.476422  0.701824
164  3.426324 -1.118147  0.318881  0.305853
438 -3.132463 -2.059160 -1.135943  0.357514
443  0.694133 -3.153685  0.689038  0.499894
519 -3.186767 -1.396028 -2.058613 -0.884477
689  0.582731  0.255797  3.765516 -0.374482
913  1.965969  0.901942  3.004477  0.894651
993  0.546546  0.372888 -0.767083  4.158149

In [21]:
data[np.abs(data)>3] = np.sign(data)*3

In [22]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [23]:
sampler = np.random.permutation(5)
df.take(sampler)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7

In [24]:
val = 'a,b, huide'
val.split(',')

['a', 'b', ' huide']

In [25]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'huide']

In [26]:
first,second,third = pieces
first + '::' + second + '::' + third

'a::b::huide'

In [27]:
'+'.join(pieces)

'a+b+huide'

In [28]:
import re
text = "fool bar\t baz \tqux"
re.split('\s+',text)

['fool', 'bar', 'baz', 'qux']

In [29]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
re.compile(pattern,flags=re.IGNORECASE).findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [30]:
data = {'Dave':'dave@google.com',
       'Steve':'steve@gmail.com',
       'Rob':'rob@gmail.com',
       'Wes':np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [31]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [32]:
pattern = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [33]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object